<template>
  <div class="start">
    <div class="g-banner">
      <div class="m-title">微算面相</div>
      <img class="m-bannerImg" src="../assets/images/group2.svg">
      <img class="m-bannerBk" src="../assets/images/Combined.png">
      <div class="m-bannerContent">
        <div class="s-leftBem">
          <div class="title">面相报告</div>
          <div class="content">已生成9160份</div>
        </div>
        <div class="s-rightBem">
          <swiper loop auto height="aspect-ratio" :show-dots="dots">
            <swiper-item class="black"><span>123afasd是的反思</span><b>已获取面相报告</b><div class="div-box"><img src="https://faceplus.qqwechat.com/2019-02-27_b51200423584200c02bb08064f704632.png?x-oss-process=image/crop,x_8,y_65,w_272,h_272" alt=""></div></swiper-item>
            <swiper-item class="black"><span>阿斯顿发送到发的</span><b>已获取面相报告</b><div class="div-box"><img src="https://faceplus.qqwechat.com/2019-02-27_64d4e7deaa87e5f4ae2c27e9bdfde37e.png?x-oss-process=image/crop,x_234,y_80,w_485,h_485" alt=""></div></swiper-item>
            <swiper-item class="black"><span>阿斯顿发送到发的</span><b>已获取面相报告</b><div class="div-box"><img src="https://faceplus.qqwechat.com/2019-02-27_64d4e7deaa87e5f4ae2c27e9bdfde37e.png?x-oss-process=image/crop,x_234,y_80,w_485,h_485" alt=""></div></swiper-item>
          </swiper>
        </div>
      </div>
    </div>
    <div class="g-synopsis">
      <div class="m-title">人工智能看面相</div>
      <div class="m-content">相由心生，境随心转。面相学通过观看面部特征来解码人生命运，微算面相程序则利用人工智能深度神经网络学习技术与人脸识别定位技术将这一中国传统文化重新呈现</div>
      <div class="m-icon">
        <div class="s-item">
          <img src="../assets/images/Group8.svg" alt="">
          <div>面相学</div>
        </div>
        <div class="s-item">
          <img src="../assets/images/rgzn.svg" alt="">
          <div>人工智能</div>
        </div>
        <div class="s-item">
          <img src="../assets/images/rldw.svg" alt="">
          <div>人脸定位</div>
        </div>
      </div>
      <div class="m-btn" @click="showDiaContent">免费在线获取面相报告</div>
    </div>
    <div class="g-ps" v-show="showdia" @click.self="showDiaContent">
      <transition name="slide-fade">
        <div class="m-tost" v-show="showdia">
          <p>微算面相使用协议</p>
          <div class="s-content">
            1.总则
            <br>
            微算面相根据以下服务条款为您提供服务。这些条款可由微算面相随时更新，且毋须另行通知。《微算面相使用协议》（以下简称“《使用协议》”）及《用户隐私协议》（以下简称“《隐私协议》”）一旦发生变动，微算面相将在网页上公布修改内容，修改后的使用协议一旦在网页上公布即有效代替原来的使用协议。
            <br>
            您在每次使用微算面相提供的各项服务之前，应仔细阅读本使用协议及《隐私协议》内容。如您不同意本使用协议及/或随时对其的修改，请您立即停止使用微算面相所提供的全部服务；您一旦使用微算面相服务，即视为您已了解并完全同意本使用协议及《隐私协议》各项内容，包括微算面相对使用协议及《隐私协议》随时所做的任何修改，并成为微算面相用户（以下简称“用户”）。
            <br>
            2.服务说明
            <br>
            微算面相目前向用户提供如下服务：用户可通过上传面部照片来获取面相分析服务。除非本使用协议另有其它明示规定，增加或强化目前本服务的任何新功能，包括所推出的新产品，均受到本使用协议之规范。您了解并同意，本服务仅依其当前所呈现的状况提供，对于任何用户信息或个人化设定之时效、删除、传递错误、未予储存或其它任何问题，微算面相均不承担任何责任。微算面相保留不经事先通知为维修保养、升级或其它目的暂停本服务任何部分的权利。
            <br>
            3.遵守法律
            <br>
            您同意遵守中华人民共和国相关法律法规的所有规定，并对以任何方式使用您的微信账号授权登录并使用本服务的任何行为及其结果承担全部责任。如您的行为违反国家法律和法规的任何规定，导致应承担任何刑事、行政、民事等法律责任的，均由您自行承担。
            <br>
            同时如果微算面相有理由认为您的任何行为，包括但不限于您的任何言论和其它行为违反或可能违反国家法律和法规的任何规定，微算面相可在任何时候不经任何事先通知终止向您提供服务。
            <br>
            4.您的授权登录义务
            <br>
            为了能使用本服务，您同意以下事项：依本服务提示请您授权微信账号进行登录，并确保账号、头像等资料的有效性和合法性。若您提供任何违法、不道德或微算面相认为不适合在微算面相上展示的资料；或者微算面相有理由怀疑你的资料属于违法或恶意操作，微算面相有权暂停或终止对您的服务，并拒绝您于现在和未来使用本服务之全部或任何部分。
            <br>
            微算面相无须对任何用户的任何登记资料承担任何责任，包括但不限于鉴别、核实任何登记资料的真实性、正确性、完整性、适用性及/或是否为最新资料的责任。
            <br>
            5.用户信息及安全
            <br>
            授权本服务（一般指直接获取微信授权登录）之后，您可使用您的授权信息（包括微信昵称、头像、个人信息等），登录微算面相并使用相关服务。保护您的帐号安全，是您的责任。微算面相不会从您的授权中获取任何除您授权信息（包括微信昵称、头像、个人信息等）以外的非公开信息，您应对所有授权后的使用行为负完全的责任。您同意：
            <br>
            1)您的微信账号因使用微算面相发生任何安全问题时，您将立即通知微算面相；
            <br>
            2)非因微信授权登录微算面相直接导致的任何损失或损害，微算面相无法也不承担任何责任；
            <br>
            3)如果您的授权信息对您、微算面相或第三方造成任何损害，包括但不限于侵犯人格权、知识产权、个人隐私、商业秘密等，您将负全部责任。
            <br>
            6.微算面相隐私权政策
            <br>
            您提供的登记资料及微算面相保留的有关您的若干其它资料将受到中国有关隐私的法律和微算面相《隐私协议》之规范。
            <br>
            7.提供者之责任
            <br>
            根据有关法律法规，微算面相在此郑重提请您注意，任何经由本服务而发布、上传的文字、资讯、资料、音乐、照片、图形、视讯、信息或其它资料（以下简称“内容”），无论系公开还是私下传送，均由内容提供者承担责任。微算面相仅为用户提供内容存储空间，无法控制经由本服务传送之内容，因此不保证内容的正确性、完整性或品质。您已预知使用本服务时，可能会接触到令人不快、不适当或令人厌恶之内容。在任何情况下，微算面相均不为任何内容负责，但微算面相有权依法停止传输任何前述内容并采取相应行动，包括但不限于暂停用户使用本服务的全部或部分，保存有关记录，并向有关机关报告。
            <br>
            8.用户行为
            <br>
            用户同意将不会利用本服务进行任何违法或不正当的活动，包括但不限于下列行为∶
            <br>
            1)发布或以其它方式传送含有下列内容之一的信息：
            <br>
            * 反对宪法所确定的基本原则的；
            <br>
            * 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
            <br>
            * 损害国家荣誉和利益的；
            <br>
            * 煽动民族仇恨、民族歧视、破坏民族团结的；
            <br>
            * 破坏国家宗教政策，宣扬邪教和封建迷信的；
            <br>
            * 散布谣言，扰乱社会秩序，破坏社会稳定的；
            <br>
            * 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
            <br>
            * 侮辱或者诽谤他人，侵害他人合法权利的；
            <br>
            * 含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；
            <br>
            * 含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；
            <br>
            * 含有微算面相认为不适合展示的内容；
            <br>
            2)以任何方式危害他人的合法权益；
            <br>
            3)冒充其他任何人或机构，或以虚伪不实的方式陈述或谎称与任何人或机构有关；
            <br>
            4)将依据任何法律或合约或法定关系（例如由于雇佣关系和依据保密合约所得知或揭露之内部资料、专属及机密资料）知悉但无权传送之任何内容加以发布、发送电子邮件或以其它方式传送；
            <br>
            5)将侵害他人著作权、专利权、商标权、商业秘密、或其它专属权利（以下简称“专属权利”）之内容加以发布或以其它方式传送；
            <br>
            6)将任何广告信函、促销资料、“垃圾邮件”、““滥发信件”、“连锁信件”、“直销”或其它任何形式的劝诱资料加以发布、发送或以其它方式传送；
            <br>
            7)将设计目的在于干扰、破坏或限制任何计算机软件、硬件或通讯设备功能之计算机病毒或其它计算机代码、档案和程序之任何资料，加以发布、发送或以其它方式传送；
            <br>
            8)干扰或破坏本服务或与本服务相连线之服务器和网络，或违反任何关于本服务连线网络之规定、程序、政策或规范；
            <br>
            9)跟踪、人肉搜索或以其它方式骚扰他人；
            <br>
            10)故意或非故意地违反任何适用的当地、国家法律，以及任何具有法律效力的规则；
            <br>
            11)未经合法授权而截获、篡改、收集、储存或删除他人个人信息、站内邮件或其它数据资料，或将获知的此类资料用于任何非法或不正当目的。
            <br>
            您已认可微算面相无法对用户的使用行为进行全面控制，您使用任何内容时，包括依赖前述内容之正确性、完整性或实用性时，您同意将自行加以判断并承担所有风险，而不依赖于微算面相。但微算面相依其自行之考虑，有权拒绝和删除任何违反本使用协议的任何内容。
            <br>
            您了解并同意，微算面相依据法律法规的要求，或基于诚信为了以下目的或在合理必要范围内，认定必须将内容加以保存或揭露时，得加以保存或揭露：
            <br>
            a)遵守法律程序；
            <br>
            b)执行本使用协议；
            <br>
            c)回应任何第三人提出的权利主张；
            <br>
            d)保护微算面相、其用户及公众之权利、财产或个人安全；
            <br>
            e)其它微算面相认为有必要的情况。
            <br>
            9.国际使用之特别警告
            <br>
            您已了解国际互联网的无国界性，同意遵守当地所有关于网上行为及内容之法律法规。您特别同意遵守有关从中国或您所在国家或地区输出信息之传输的所有适用法律法规。
            <br>
            10.在微算面相发布的公开信息
            <br>
            1)在本使用协议中，“本服务公开使用区域”系指一般公众可以使用的区域；
            <br>
            2)用户在微算面相上传或发布的内容，用户应保证其上传图片为本人肖像或已取得合法授权，上传肖像为摄影、画像等作品的，用户应为著作权人或经过相关权利人许可，并且该内容不会侵犯任何第三方的合法权益，用户同意授予微算面相所有上述内容在全球范围内的免费、不可撤销的、永久的、可再许可或转让的独家使用权许可，据该许可微算面相将有权以展示、推广及其他不为我法律所禁止的方式使用前述内容。任何因用户不具有上述权利导致的权利侵害后果均由用户本人承担。
            <br>
            11.免责声明
            <br>
            1)用户明确同意其将文字、资讯、资料、音乐、照片、图形、视讯、信息或其它个人资料上传到互联网上，有可能被其他组织或个人复制、转载、或做其它用途的风险完全由其自己承担；因其使用微算面相服务而产生的一切后果也由其自己承担，我们对用户不承担任何责任。
            <br>
            2)微博、微信等官方帐号对用户的相关文字、资讯、资料、音乐、照片、图形、视讯、信息或其它个人资料进行推广发布的，不属于对用户相关权益的侵权行为、微算面相不承担任何责任。
            <br>
            网站上针对用户的恶意评论，经用户的举报我们会采取删除处理，但不保证服务一定能满足用户的要求，也不对该恶意评论负任何法律责任。
            因用户上传内容侵犯他人肖像权、著作权、人格尊严、个人隐私等任何权利及荣誉或违反任何法律规定的，由此产生的全部争议或应承担的法律责任，由用户个人承担，与微算面相无关。微算面相对上述违规上传图片所作出的测算结果是根据图片本身由计算机系统经测算得出，不是微算面的及其运营主体所作出的意思表示，不作为相关权利人主张微算面相侵权或违法之依据，任何因违规上传图片所导致的测算结果导致的包括但不限于侮辱、诽谤、信息不实等全部责任均由上传或发布图片的用户本人承担。
            <br>
            12.赔偿
            <br>
            您同意承担由于您通过本服务提供、发布或传送之内容、您与本服务连线、您违反本使用协议、或您侵害他人任何权利的行为，因而衍生或导致任何第三人提出任何索赔或请求，包括合理的律师费、保全费等费用。同时，您同意赔偿微算面相及其运营主体、子公司、关联企业、高级职员、代理人、品牌共有人或其它合作伙伴及员工因您违反本《使用协议》及《隐私协议》规定之行为导致的损害，并使其免受损害，并承担由此引发的全部法律责任。
            <br>
            13.禁止商业行为
            <br>
            您同意不对本服务任何部分或本服务之使用或获得，进行复制、拷贝、出售、转售或用于任何其它商业目的。
            <br>
            14.关于使用及储存之一般措施
            <br>
            您承认关于本服务的使用微算面相有权制订一般措施及限制，包含但不限于本服务将保留所发布内容或其它发布内容之最长期间，以及一定期间内您使用本服务之次数上限（及每次使用时间之上限）。通过本服务发布或传送之任何信息、通讯资料和其它内容，如被删除或未予储存，您同意微算面相毋须承担任何责任。您也同意，微算面相有权依其自行之考虑，不论通知与否，随时变更这些一般措施及限制。
            <br>
            15.服务之修改
            <br>
            微算面相有权于任何时间暂时或永久修改或终止本服务（或其任何部分），且无论通知与否。您同意对于本服务所作的任何修改、暂停或终止，微算面相对您和任何第三人均无需承担任何责任。
            <br>
            16.终止服务
            <br>
            您同意微算面相基于其自行之考虑，因任何理由，包含但不限于缺乏使用，或微算面相认为您已经违反本使用协议的内容及精神，终止您继续本服务之使用（或服务之任何部分），并将您在本服务内任何内容加以移除并删除。您同意依本使用协议任何规定提供之本服务，无需进行事先通知即可中断或终止，您承认并同意，微算面相可立即关闭或删除您授权登录使用中所有相关信息及文件，及/或禁止继续使用前述文件或本服务。此外，您同意若本服务之使用被中断或终止或您的帐号及相关信息和文件被关闭或删除，微算面相对您或任何第三人均不承担任何责任。
            <br>
            17.微算面相之专属权利
            <br>
            您了解并同意，本服务及本服务所使用之相关软件（以下简称“软件”）含有受到相关知识产权及其它法律保护之专有保密资料。您也了解并同意，经由本服务向您呈现之信息所包含之内容，亦受到著作权、商标权、专利权或其它专属权利之法律保护。未经微算面相或广告商明示授权，您不得修改、保存、出租、出借、出售、散布本服务或软件之任何部份或全部，或据以制作衍生著作，或使用擅自修改后的软件，包括但不限于为了未经授权而使用本服务之目的。微算面相仅授予您个人、不可移转及非专属之使用权，使您得以通过微信授权登录的方式使用微算面相软件，但您不得（并不得允许任何第三人）复制、修改、创作衍生著作、进行还原工程、反向组译，或以其它方式发现原始码，或出售、转让、再授权或提供软件设定担保，或以其它方式移转软件之任何权利。您同意将通过由微算面相所提供的界面而非任何其它途径使用本服务。
            <br>
            19.担保与保证
            <br>
            您明确了解并同意∶
            <br>
            1)本使用协议的任何规定不会免除微算面相对造成您人身伤害的、或因故意或重大过失造成您财产损失的任何责任；
            <br>
            2)您使用本服务之风险由您个人负担。本服务系依“现状”及“现有”基础提供。微算面相对本服务不提供任何明示或默示的担保或保证，包含但不限于商业适售性、特定目的之适用性及未侵害他人权利等担保或保证；
            <br>
            3)微算面相不保证以下事项∶
            <br>
            * 本服务将符合您的要求；
            <br>
            * 本服务将不受干扰、及时提供、安全可靠或不会出错；
            <br>
            * 使用本服务取得之结果正确可靠；
            <br>
            * 您经由本服务购买或取得之任何产品、服务、资讯或其它信息将符合您的期望；
            <br>
            4)是否使用本服务下载或取得任何资料应由您自行考虑且自负风险，因任何资料之下载而导致的您手机之任何损坏或数据流失等后果，由您自行承担；
            <br>
            5)您自微算面相或经由本服务取得的任何建议或信息，无论是书面或口头形式，除非本使用协议有明确规定，将不构成任何保证，您对于由本服务取得的任何建议或信息应具有独立自主的鉴别能力，由本服务取得的任何建议或信息不构成微算面相的任何承诺及意思表示。
            <br>
            6)如果微算面相和/或合作单位使用您提供的肖像、姓名或其他合法权益，您同意将您的肖像、姓名和/或其他合法权益一并授权给微算面相和/或合作单位使用。
            <br>
            20.责任限制
            <br>
            您明确了解并同意，基于以下原因而造成的，包括但不限于利润、信誉、应用、数据损失或其它无形损失，微算面相不承担任何直接、间接、附带、特别、衍生性或惩罚性赔偿责任：
            <br>
            1)本服务之使用或无法使用；
            <br>
            2)为替换从或通过本服务购买或取得之任何商品、数据、信息、服务，收到的讯息，或缔结之交易而发生的成本；
            <br>
            3)您的传输或数据遭到未获授权的存取或变造；
            <br>
            4)任何第三方在本服务中所作之声明或行为；
            <br>
            5)与本服务相关的其它事宜，但本使用协议有明确规定的除外；
            <br>
            6)第三方以任何方式发布或投递欺诈性信息，或诱导用户受到经济损失，微算面相不承担任何责任。
            <br>
            21.微算面相商标信息
            <br>
            未经微算面相事先书面同意，您同意不将微算面相及其他微算面相注册商标、标志及产品、服务名称以任何方式展示或使用或作其它处理，或表示您有权展示、使用或另行处理。
            <br>
            22.用户专属权利
            <br>
            微算面相尊重他人知识产权，呼吁用户也要同样尊重知识产权。
            <br>
            微算面相之服务与资料是基于“现状”提供，而且微算面相明确地表示拒绝对于“服务”、“资料”或“产品”给予任何明示或暗示之保证，包括但不限于，得为商业使用或适合于特定目的之保证。微算面相对于因“服务”、“资料”或“产品”所生之任何直接、间接、附带的或因此而导致之衍生性损失概不负责。
            <br>
            如果您对他人的知识产权造成了侵害，微算面相将依国家法律法规的规定，或在适当的情形下，将依其服务条款或其相关规范性规定，删除特定内容或以至终止您对账户的使用。
            <br>
            微算面相尊重他人的任何权利（包括知识产权），同时也要求我们的使用者也尊重他人之权利。微算面相在适当情况下，得自行决定终止侵害或违反他人权利之使用者的帐号。
            <br>
            若您认为您的作品的著作权遭到侵害或您的知识产权被侵犯，根据《信息网络传播权保护条例》的规定，您需及时向微算面相联系并提供详实的举证材料。或请到中华人民共和国国家版权局下载《要求删除或断开链接侵权网络内容的通知》（下称“删除通知”）的示范格式，如果您不明白“删除通知”的内容，请登录中华人民共和国国家版权局查看《要求删除或断开链接侵权网络内容的通知》填写说明。
            <br>
            23. 一般条款
            <br>
            1)本使用协议、《隐私协议》构成您与微算面相之全部协议，并规范您对于本服务之使用行为。在您使用相关服务、使用第三方提供的内容或软件时，亦应遵从所适用之附加条款及条件；
            <br>
            2)本使用协议及您与微算面相之关系，均受到中华人民共和国法律管辖。您与微算面相就本服务、本使用协议或其它有关事项发生的争议，应首先友好协商解决，协商不成时应提请中国国际经济贸易仲裁委员会仲裁，仲裁裁决是终局性的，对双方均有约束力；
            <br>
            3)微算面相未行使或执行本使用协议任何权利或规定，不构成对前述权利或权利之放弃；
            <br>
            4)如本使用协议之任何规定因与中华人民共和国法律抵触而无效，您依然同意应依照法律，努力使该规定所反映之当事人意思表示具备效力，且本使用协议其它规定仍应具有完整的效力及效果；
            <br>
            5)本使用协议之标题仅供方便而设，不具任何法律或契约效果；
            <br>
            6)只要您登录微算面相，就代表您认可以上所有协议。
            <br>
            7)微算面相对本使用协议享有最终解释权。
          </div>
          <router-link tag="div" :to="{name:'uploadImage'}" class="s-btn-tost">我已阅读完并同意</router-link>
        </div>
      </transition>
  </div>
  </div>
</template>

<script>
  import { Swiper,SwiperItem } from 'vux'
  export default {
    name: "start",
    data(){
      return {
        dots:false,
        showdia:false
      }
    },
    methods:{
      showDiaContent(){
        this.showdia=!this.showdia;
      }
    },
    components:{
      Swiper,
      SwiperItem
    }
  }
</script>

<style scoped lang="stylus">
.start
  .g-banner
    height 320px
    background url(../assets/images/startBanner.png) no-repeat center top
    background-size 100%
    background-position 0 -50px
    position relative
    .m-title
      color #fff
      font-size: 25px;
      padding-top: 20px;
      margin-left: 20px;
      animation fadein 0.5s linear
    .m-bannerImg
      position: absolute;
      top: -150px;
      left: -168px;
      width: 440px;
      height: 440px;
      animation circle 100s linear infinite
    .m-bannerBk
      position: absolute;
      top: 5.33333333rem;
      width: 100%;
    .m-bannerContent
      height: 1.06666667rem;
      width: 8.61333333rem;
      margin: 0 auto;
      position: absolute;
      bottom: 1.6rem;
      left: 0.4rem;
      background: #fff;
      padding: 0.26666667rem;
      display: flex;
      box-shadow 0 0.02666667rem 0.06666667rem 0.04rem rgba(0, 0, 0, 0.13)
      .s-leftBem
        width: 2.4rem;
        display: flex;
        flex-direction: column;
        border-right: 0.01333333rem solid #eee;
        margin-right: 0.26666667rem;
        -webkit-box-orient: vertical;
        -webkit-box-direction: normal;
        .title
          font-size: 0.48rem;
          font-family: Bitstream;
        .content
          font-size: 0.32rem;
          color: #c8c7cc;
      .s-rightBem
        flex: 1;
        line-height: 1.06666667rem;
        font-size: 0.37333333rem;
        overflow: hidden;
        >>>.vux-slider
          span,b,.div-box
            vertical-align middle
          b
            font-weight normal
          span
            display inline-block
            width: 50px;
            overflow: hidden;
            text-overflow: ellipsis;
            white-space: nowrap;
            text-align: center;
          div.div-box
            display inline-block
            width: 1.06666667rem;
            height: 1.06666667rem;
            margin-left: 0.42666667rem;
            border-radius: 100%;
            overflow: hidden;
            img
              width 100%
              height 100%
              filter: blur(1px);
  .g-synopsis
    width: 7.76rem;
    background: #ffffff;
    box-shadow: 0rem 0.02666667rem 0.13333333rem 0rem rgba(0, 0, 0, 0.12);
    border-radius: 0.04rem;
    margin: -1.06666667rem auto 1.33333333rem;
    padding: 0 0.69333333rem;
    overflow: hidden;
    position: relative;
    .m-title
      height: 0.64rem;
      font-size: 20px;
      color: #4a4a4a;
      line-height: 0.64rem;
      margin-top: 0.37333333rem;
      text-align center
    .m-content
      font-size: 14px;
      color: #717171;
      line-height: 0.53333333rem;
      margin-top: 0.29333333rem;
      text-align: left;
    .m-icon
      display flex
      margin: 1rem 0;
      width: 100%;
      .s-item
        flex 1
        text-align center
        img
          height: 0.66666667rem;
          width: 0.53333333rem;
        div
          font-size: 14px;
    .m-btn
      width: 6.66666667rem;
      line-height: 1.17333333rem;
      background: #1B1B1B;
      border-radius: 0.93333333rem;
      font-size: 0.4rem;
      color: #fff;
      margin: 10px auto 20px;
      padding: 0 0.13333333rem;
      text-align center
  .g-ps
    width: 100%;
    height: 100%;
    position: fixed;
    top: 0;
    background: rgba(0, 0, 0, 0.5);
    z-index: 1000;
    .m-tost
      margin: 1.33333333rem 0.69333333rem;
      width: 8.08rem;
      height: 11.33333333rem;
      background: #fff;
      padding: 0.46666667rem 0.26666667rem;
      display: flex;
      flex-direction: column;
      border-radius: 0.21333333rem;
      animation: topinto-data-v-2267e271 1s;
      p
        margin-top: 0.53333333rem;
        font-size: 0.53333333rem;
        margin-bottom: 0.37333333rem;
        color: #4a4a4a;
        text-align center
      .s-content
        padding: 0 0.53333333rem;
        font-size: 0.37333333rem;
        color: #4a4a4a;
        text-align: left;
        height: 265px
        overflow: auto;
      .s-btn-tost
        width: 5.33333333rem;
        height: 1.17333333rem;
        background: #1B1B1B;
        border-radius: 0.58666667rem;
        line-height: 1.17333333rem;
        color: #fff;
        margin: 0.53333333rem auto 0.8rem;
        font-size: 12px;
        text-align center
</style>
